import pandas as pd

# Початкові дані
stores_profit = {
    "У Галі": [7500, 15000, 5600, 7400],
    "Риба/м'ясо": [14000, 23000, 13700, 19500],
    "Пакєтік": [8900, 9300, 10200, 11000],
    "Свіжачок": [2300, 5700, 4850, 6300],
    "Хмаринка": [21000, 24000, 29500, 23500]
}

# Перетворення у DataFrame
df = pd.DataFrame(stores_profit)

# Додаємо новий стовпець із сезонами
df['Сезон'] = ['Осінь', 'Зима', 'Весна', 'Літо']

# Виведення DataFrame
print("Початковий DataFrame:")
print(df)

# Описова статистика для "Риба/м'ясо"
print("\nСтатистика для 'Риба/м'ясо':"
      "\nСереднє значення прибутку = ", df["Риба/м'ясо"].mean(),
      "\nПрибуток за рік = ", df["Риба/м'ясо"].sum(),
      "\nМінімальний прибуток = ", df["Риба/м'ясо"].min(),
      "\nМаксимальний прибуток = ", df["Риба/м'ясо"].max())

# Аггрегація: середнє по кожному магазину
mean_scores = df.iloc[:, :-1].mean()
print("\nСередній прибуток кожного магазину:")
print(mean_scores)

# Групування за предметом
grouped = df.groupby('Сезон').mean()
print("\nСередній прибуток за сезон:")
print(grouped)